//Standard
R1>enable
R1#config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#access-list 11 deny host 192.168.2.10  #####R1(config)#access-list 11 deny 192.168.2.0 0.0.0.255

R1(config)#access-list 11 permit any
R1(config)#interface gig0/0
R1(config-if)#ip access-group 11 out
R1(config-if)#


//Extended
R2>enable
R2#config terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#access-list 100 deny ?
  ahp    Authentication Header Protocol
  eigrp  Cisco's EIGRP routing protocol
  esp    Encapsulation Security Payload
  gre    Cisco's GRE tunneling
  icmp   Internet Control Message Protocol
  ip     Any Internet Protocol
  ospf   OSPF routing protocol
  tcp    Transmission Control Protocol
  udp    User Datagram Protocol
R2(config)#access-list 100 deny tcp ?
  A.B.C.D  Source address
  any      Any source host
  host     A single source host
R2(config)#access-list 100 deny tcp 192.168.4.0 0.0.0.255 host 192.168.1.11 eq ?
  <0-65535>  Port number
  ftp        File Transfer Protocol (21)
  pop3       Post Office Protocol v3 (110)
  smtp       Simple Mail Transport Protocol (25)
  telnet     Telnet (23)
  www        World Wide Web (HTTP, 80)
R2(config)#access-list 100 deny tcp 192.168.4.0 0.0.0.255 host 192.168.1.11 eq www
R2(config)#access-list 100
R2(config)#access-list 100 permit ip any any
R2(config)#interface gig0/1
R2(config)#interface gig0/1
	
R2(config-if)#ip access-group 100 in
R2(config-if)#
